docs/progress_narrative/progress_narrative.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-06-22 Sun 19:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Progress Narrative</title>
<meta name="author" content="Noelle Crawford" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Progress Narrative
<br />
<span class="subtitle"><i>"God isn't compatible with machinery and scientific medicine and universal happiness. You must make your choice. Our civilization has chosen machinery and medicine and happiness.”</i> &#x2013; Aldus Huxley, Brave New World</span>
</h1>
<p>
I'm a huge fan of science fiction.
As scientific and technological progress are seeing a cambrian explosion of new ideas, the genre offers such unique perspectives on the political and social structures that will emerge in the changing world landscape. To me, reading and thinking about the potential interactions between humans and technology is almost as interesting as the futuristic technologies themselves.
</p>

<p>
One common theme amongst novels seems to be showing progress as both a blessing and a curse, with authors warning of the challenges a technologically advances future will bring.
We are programmed to fear change, and so it is unsuprising thta this is reflected in fiction.
In fact, so much technology that we still regard as "science fictional" actually exists today (Huel can remove the need to cook, Zest is a pill to wake you up without grogginess), and yet these amazing tools are not seeing the utilization they deserve.
</p>

<p>
I've recently been on a bit of a self-improvement kick, and, inspired by biohackers, I've decided to try some at-home experimentation.
Using only commercially available products, I'm trying to collect as much data as possible on my life, and how certain changes affect me day-to-day.
</p>

<p>
All data I collect can be found <b>here (TODO)</b> and will be updated at least weekly.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Noelle Crawford</p>
<p class="date">Created: 2025-06-22 Sun 19:33</p>
</div>
</body>
</html>
